tutorials4NF/unsteadyStateForcedConvection4NF/miniChannelMonoHomogenous/constant/nanoFluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      nanoFluidProperties;
}
//------------------------------- nanoFluid4Foam project -------------------------------//
//Author
    //Ehsan Golab, SUT. All rights reserved.
    //Ehsan1996Golab@gmail.com

//--------------------------------------------------------------------------------------//


//************************************************ baseFluid ************************************************//
baseFluid			(water);
moleFraction			(1.0);
#include "../../../materialsDict.H";
transportModel			Newtonian;


//************************************************ particle ************************************************//
particle			( (Cu MNP) );
particleDict
{
    Cu
    {
        Components		(Cu);
        moleFraction		(1.0);
    }
}


//************************************************ nanoFluid ************************************************//
nanoFluidModel			(mono Heterogeneous);//Homogenous-Heterogeneous
thermalConductivityModel	JangChoi;
JangChoiCoeffs
{
    beta			0.01;
    C				18e6;
    dbf dbf [ 0 1 0 0 0 0 0 ]	0.275e-9;
    lbf lbf [ 0 1 0 0 0 0 0 ]	2.8e-7;
    dnp dnp [ 0 1 0 0 0 0 0 ]	100e-9;
}

dynamicViscosityModel		Mooney;
MooneyCoeffs
{
    kesi			2.5;
    zeta			1.35;
}

//***************** Heterogeneous *****************//
brownianDiffusivityModel	Brownian;
BrownianCoeffs
{
    dnp				(50e-9);
}

thermophoresisDiffusivityModel		McNabMeisen;
McNabMeisenCoeffs{}


//############################################### End #######################################################//
